Repository: paolofantozzi/rpb-chessboard
Catalog: languages/rpb-chessboard-*.po
Languages: fr_fr, pt_br

source: No navigation board.
fr_fr: Pas d'échiquier de navigation.
pt_br: Sem tabuleiro de navegação.

source: The navigation board is displayed in a popup frame, which becomes visible when the user clicks on a move within the move list.
fr_fr: L'échiquier de navigation est affiché dans un popup, lequel devient visible lorsque l'utilisateur clique sur un coup.
pt_br: O tabuleiro de navegação é exibido num quadro popup, que fica visível quando o usuário clica num lance na lista de lances da partida.

source: The navigation board is displayed above the game headers and the move list.
fr_fr: L'échiquier de navigation est affiché au-dessus des en-têtes et de la liste de coups.
pt_br: O tabuleiro de navegação é exibido acima dos cabeçalhos da partida e da lista de lances.

source: The navigation board is displayed below the move list.
fr_fr: L'échiquier de navigation est affiché en dessous de la liste de coups.
pt_br: O tabuleiro de navegação é exibido abaixo da lista de lances.

source: The navigation board is displayed on the left of the move list.
fr_fr: L'échiquier de navigation est affiché à gauche de la liste de coups.
pt_br: O tabuleiro de navegação é exibido à esquerda da lista de lances.

source: The navigation board is displayed on the right of the move list.
fr_fr: L'échiquier de navigation est affiché à droite de la liste de coups.
pt_br: O tabuleiro de navegação é exibido à direita da lista de lances.

source: The navigation board is displayed on the left of the move list. The move list becomes scrollable if it is higher than the navigation board.
fr_fr: L'échiquier de navigation est affiché à gauche de la liste de coups. Une barre de défilement est ajoutée à la liste des coups si celle-ci est plus haute que l'échiquier de navigation.
pt_br: O tabuleiro de navegação é exibido à esquerda da lista de lances. A lista de lances ganhará uma barra de rolagem se for maior que o tabuleiro de navegação.

source: The navigation board is displayed on the right of the move list. The move list becomes scrollable if it is higher than the navigation board.
fr_fr: L'échiquier de navigation est affiché à droite de la liste de coups. Une barre de défilement est ajoutée à la liste des coups si celle-ci est plus haute que l'échiquier de navigation.
pt_br: O tabuleiro de navegação é exibido à direita da lista de lances. A lista de lances ganhará uma barra de rolagem se for maior que o tabuleiro de navegação.

source: The %1$s attribute controls whether the button that allows to flip the board is available or not (below the navigation board).
fr_fr: L'attribut %1$s détermine si le bouton permettant de tourner l'échiquier est disponible ou pas (en dessous de l'échiquier de navigation).
pt_br: O atributo %1$s controla se o botão que permite virar o tabuleiro está disponível ou não (abaixo do tabuleiro de navegação).

source: No flip button.
fr_fr: Pas de bouton pour tourner l'échiquier.
pt_br: Nenhum botão para girar tabuleiro.

source: The flip button is visible.
fr_fr: Le bouton pour tourner l'échiquier est visible.
pt_br: Botão para girar tabuleiro está visível.

source: Similarly, the %1$s attribute affects whether the button that allows to download the game is available or not.
fr_fr: De même, l'attribut %1$s détermine si le bouton de téléchargement est disponible ou pas.
pt_br: Da mesma forma, o atributo %1$s controla se o botão que permite fazer download da partida está disponível ou não.

source: No download button.
fr_fr: Pas de bouton de téléchargement.
pt_br: Botão download não está visível.

source: The download button is visible.
fr_fr: Le bouton de téléchargement est visible.
pt_br: Botão download está visível.

source: The %1$s, %2$s, %3$s, %4$s and %5$s attributes control the aspect of both the navigation board and the chessboard diagrams inserted using tag %6$s. These attributes are identical to those used to customize the aspect of standalone FEN diagrams (those inserted using tag %7$s): see %8$shelp on FEN diagram attributes%9$s for more details about them.
fr_fr: Les attributs %1$s, %2$s, %3$s, %4$s et %5$s déterminent l'apparence de l'échiquier de navigation et des diagrammes insérés dans les commentaires via la balise %6$s. Ces attributs sont identiques à ceux utiliser pour personnaliser l'apparence des diagrammes FEN autonomes (ceux insérés via la balise %7$s)&nbsp;: voir %8$sl'aide sur les attributs des diagrammes FEN%9$s pour plus d'information.
pt_br: Os atributos %1$s, %2$s, %3$s, %4$s e %5$s controlam a aparência dos diagramas no tabuleiro de navegação e dos diagramas inseridos usando a tag %6$s. Esses atributos são idênticos aos usados para personalizar a aparência dos diagramas FEN independentes (aqueles inseridos usando a tag %7$s): consulte %8$sajuda para atributos de diagramas FEN%9$s para obter mais informações.

source: The %1$s attribute controls whether piece displacements are animated or not.
fr_fr: L'attribut %1$s détermine si les déplacements de pièce sont animés ou non.

source: No animation.
fr_fr: Pas d'animation.

source: The displacements are animated.
fr_fr: Les déplacements sont animés.

source: The %1$s attribute controls whether an arrow should be used or not to highlight the moves on the navigation board.
fr_fr: L'attribut %1$s détermine si une flèche doit ou pas être utilisée pour mettre en évidence les coups sur l'échiquier de navigation.
pt_br: O atributo %1$s controla se uma seta deve ou não ser usada para realçar os lances no tabuleiro de navegação.

source: No arrow is shown.
fr_fr: Aucune flèche n'est affichée.
pt_br: Nenhuma seta é mostrada.

source: The moves are highlighted by an arrow.
fr_fr: Les coups sont mis en évidence avec une flèche.
pt_br: Os lances são realçados por uma seta.

source: The string between the %1$s[%3$s][/%3$s]%2$s tags describe the position. The used notation follows the standard %4$sFEN format%5$s (Forsyth-Edwards Notation), which is comprehensively described on %4$sWikipedia%5$s.
fr_fr: Le texte entre les balises %1$s[%3$s][/%3$s]%2$s décrit la position. La notation utilisée suit le %4$sformat FEN%5$s standard (Forsyth-Edwards Notation). Une description exhaustive de cette notation FEN est disponible sur %4$sWikipédia%5$s.
pt_br: A sequência de caracteres entre as tags %1$s[%3$s][/%3$s]%2$s descreve a posição. A notação usada segue o %4$sformato FEN%5$s padrão (Notação de Forsyth-Edwards), descrito de forma abrangente na %4$sWikipedia%5$s.

source: A custom block editor for chess diagrams is provided in the WordPress post/page editor by RPB Chessboard (see the screenshot below). As a consequence, there is no need to manually edit the content of the %1$s[%3$s][/%3$s]%2$s tags to create a chessboard diagram.
fr_fr: Un éditeur de bloc de diagrammes d'échecs est intégré à l'éditeur d'articles et de pages de WordPress par RPB Chessboard (voir les captures d'écran ci-dessous). Par conséquent, il n'y a pas besoin d'éditer manuellement le texte entre les balises %1$s[%3$s][/%3$s]%2$s pour créer un diagramme.

source: Colorset and pieceset
fr_fr: Thèmes de couleurs et de pièces
pt_br: Temas de cores e peças

source: The %1$s and %2$s attributes controls respectively the colors of the chessboard and the piece theme.
fr_fr: Les attributs %1$s et %2$s déterminent respectivement les couleurs des cases de l'échiquier et le thème de pièces utilisé.
pt_br: Os atributos %1$s e %2$s controlam, respectivamente, as cores das casas do tabuleiro e o tema de peças.

source: Colorset:
fr_fr: Couleurs&nbsp;:
pt_br: Tema de cores:

source: Pieceset:
fr_fr: Pièces&nbsp;:
pt_br: Tema de peças:

source: Square, arrow, and text markers
fr_fr: Marqueurs de case, flèches, labels de case

source: The %1$s, %2$s and %3$s attributes are used to add respectively square, arrow and text markers. There is no need to manually edit the value of these attributes as square and arrow marker edition is handled by the %4$schess diagram editor%5$s.
fr_fr: Les attributs %1$s, %2$s et %3$s sont utilisés pour ajouter respectivement des marqueurs de case, des flèches, et des labels de case. Il n'est pas nécessaire d'éditer manuellement la valeur de ces attributs étant donné que l'édition des marqueurs de case et des flèches est directement gérée par %4$sl'éditeur de diagrammes%5$s.

source: For information, the syntax used to define square and arrow markers is described in the %1$sPGN game syntax help page%2$s.
fr_fr: Pour information, la syntaxe utilisée pour définir les marqueurs de case et les flèches est décrite dans %1$sl'aide sur le format des parties PGN%2$s.
pt_br: Para mais informações, o modo de definir marcadores de casa e tipo seta (lances) é descrita na %1$spágina de ajuda da sintaxe de partida PGN%2$s.

source: Square size
fr_fr: Taille des cases
pt_br: Tamanho da casa

source: The %1$s attribute controls the size of the chessboard squares.
fr_fr: L'attribut %1$s détermine la taille des cases de l'échiquier.
pt_br: O atributo %1$s controla o tamanho das casas do tabuleiro.

source: The square width is %1$s pixels.
fr_fr: Les cases font %1$s pixels de large.
pt_br: A largura da casa é %1$s pixels.

source: Any value between %1$s and %2$s can be used.
fr_fr: N'importe quelle valeur entre %1$s and %2$s peut être utilisée.
pt_br: Qualquer valor entre %1$s e %2$s pode ser usado.

source: Diagram alignment
fr_fr: Alignement des diagrammes
pt_br: Alinhamento do diagrama

source: The %1$s attribute controls how the diagram is inserted within the rest of the text.
fr_fr: L'attribut %1$s détermine la façon dont le diagramme est positionné par rapport au reste du texte.
pt_br: O atributo %1$s controla como o diagrama é inserido em relação ao restante do texto.

source: The diagram is centered.
fr_fr: Le diagramme est centré.
pt_br: O diagrama está centralizado.

source: The diagram floats on the left of the text.
fr_fr: Le diagramme flotte à gauche du texte.
pt_br: O diagrama flutua à esquerda do texto.

source: The diagram floats on the right of the text.
fr_fr: Le diagramme flotte à droite du texte.
pt_br: O diagrama flutua à direita do texto.

source: Several attributes may be passed to the %1$s[%3$s][/%3$s]%2$s tags in order to customize how the FEN diagrams are displayed. All these attributes are optional: if not specified, the default setting (defined by the blog administrator) applies. These attributes are presented in this page.
fr_fr: Plusieurs attributs peuvent être passés aux balises %1$s[%3$s][/%3$s]%2$s afin de personaliser la façon dont les diagrammes FEN sont affichés. Tous ces attributs sont optionnels&nbsp;: s'ils ne sont pas spécifiés, une valeur par défaut (définie par l'administrateur du blog) est utilisée. Ces attributs sont présentés ci-dessous.
pt_br: Vários atributos podem ser passados para as tags %1$s[%3$s][/%3$s]%2$s de modo a personalizar a exibição de diagramas FEN. Todos esses atributos são opcionais: se não especificados, a configuração padrão (definida pelo administrador do blog) se aplica. Esses atributos são apresentados nesta página.

source: Board flipping
fr_fr: Orientation de l'échiquier
pt_br: Girar tabuleiro

source: Show coordinates
fr_fr: Afficher les coordonnées
pt_br: Mostrar coordenadas

source: The %1$s attribute controls whether the row and column coordinates are visible or not.
fr_fr: L'attribut %1$s détermine si les noms des rangées et des colonnes sont ou non affichés.
pt_br: O atributo %1$s controla se as coordenadas de linhas e colunas estão visíveis ou não.

source: The row and column coordinates are hidden.
fr_fr: Les coordonnées sont masquées.
pt_br: Coordenadas de linhas e colunas estão ocultas.

source: The row and column coordinates are visible.
fr_fr: Les coordonnées sont visibles.
pt_br: Coordenadas de linhas e colunas estão visíveis.

source: The %1$s attribute controls whether the chessboard is rotated or not.
fr_fr: L'attribut %1$s détermine si l'échiquier est ou non retourné.
pt_br: O atributo %1$s controla se o tabuleiro foi ou não rotacionado.

source: The board is seen from White's point of view.
fr_fr: L'échiquier est représenté du point de vue des blancs.
pt_br: O tabuleiro é visto da perspectiva das brancas.

source: The board is seen from Black's point of view.
fr_fr: L'échiquier est représenté du point de vue des noirs.
pt_br: O tabuleiro é visto da perspectiva das pretas.

source: NAGs (aka. Numeric Annotation Glyphs)
fr_fr: NAGs (Numeric Annotation Glyphs)
pt_br: NAGs (sigla em inglês para Numeric Annotation Glyphs)

source: Notice that the chess database softwares may introduce annotations such as %1$s"$x"%2$s where %1$s"x"%2$s is replaced with one or more digits (for instance, %1$s"1.e4 $1"%2$s). This is what is advocated by the PGN norm, which defines equivalences between this syntax and the human-readable one (for instance, %1$s"$1"%2$s is equivalent to %1$s"!"%2$s). Both syntaxes are understood by the RPB Chessboard plugin. See the %3$slist of NAGs%4$s.
fr_fr: Veuillez noter que les logiciels de base de données échiquéenne peuvent introduire des annotations telles que %1$s"$x"%2$s, où %1$s"x"%2$s est remplacé par un ou plusieurs chiffres (par exemple, %1$s"1.e4 $1"%2$s). C'est ce que préconise la norme PGN, laquelle définit des équivalences entre cette syntaxe et celle "humainement compréhensible" (par exemple, %1$s"$1"%2$s et %1$s"!"%2$s sont équivalents). Les deux syntaxes sont gérées par le plugin RPB Chessboard. Voir la %3$sliste des NAGs%4$s.
pt_br: Observe que os softwares de banco de dados de xadrez podem introduzir comentários como %1$s"$x"%2$s, na qual %1$s"x"%2$s é substituído por um ou mais dígitos (por exemplo, %1$s"1.e4 $1"%2$s). É o que preconiza a norma PGN, que define equivalências entre essa sintaxe e aquela legível por humanos (por exemplo, %1$s"$1"%2$s é equivalente a %1$s"!"%2$s). Ambas as sintaxes são entendidas pelo plugin RPB Chessboard. Veja a %3$slista de NAGs%4$s.

source: https://en.wikipedia.org/wiki/Numeric_Annotation_Glyphs
fr_fr: https://fr.wikipedia.org/wiki/Portable_Game_Notation#NAG

source: Comments
fr_fr: Commentaires
pt_br: Comentários

source: I'm a %1$sshort%2$s comment.
fr_fr: Je suis un commentaire %1$scourt%2$s.
pt_br: Sou um comentário %1$scurto%2$s.

source: I'm a %1$slong%2$s comment.
fr_fr: Je suis un commentaire %1$slong%2$s.
pt_br: Sou um comentário %1$slongo%2$s.

source: Text comments can be inserted, surrounded with braces. They can be rendered either inlined within the move sequence ("short comment" style), or as separated paragraphs ("long comment" style). To insert a comment as a separated paragraph, let a blank line before it in the PGN string. Also, notice that HTML tags are allowed within comments.
fr_fr: Des commentaires textuels peuvent être insérés, encadrés par des accolades. Ceux-ci peuvent être affichés soit au sein de la liste de coups (style "commentaire court"), soit sous la forme d'un bloc isolé (style "commentaire long"). Pour insérer un commentaire sous la forme d'un bloc isolé, laisser une ligne vierge avant celui-ci dans le texte PGN. À noter en outre que les balises HTML sont autorisées dans les commentaires.
pt_br: Comentários de texto podem ser inseridos, cercados por chaves. Eles podem ser exibidos na própria linha com a sequência de lances (estilo "comentário curto") ou como parágrafos separados (estilo "comentário longo"). Para inserir um comentário como um parágrafo separado, deixe uma linha em branco antes dele na sequência PGN. Além disso, observe que as tags HTML são permitidas nos comentários.

source: The string between the %1$s[%3$s][/%3$s]%2$s tags describe the game. The used notation follows the standard %4$sPGN format%7$s, and can be automatically generated by the common chess database softwares, including %5$sChessbase%7$s, %6$sScid%7$s, etc... The PGN syntax is summarized here through a few representative examples.
fr_fr: Le code placé entre les balises %1$s[%3$s][/%3$s]%2$s décrit la partie. La notation utilisée suit le %4$sformat PGN%7$s usuel, et peut être généré de façon automatique par les logiciels de base de données échiquéenne courants tels que %5$sChessbase%7$s, %6$sScid%7$s, etc... La syntaxe PGN est résumée ici au travers d'exemples explicatifs.
pt_br: A sequência entre as tags %1$s[%3$s][/%3$s]%2$s descreve os lances de uma partida. A notação usada segue o %4$sformato PGN%7$s padrão e pode ser gerada automaticamente pelos softwares comuns de banco de dados de xadrez, incluindo %5$sChessbase%7$s, %6$sScid%7$s, etc... A sintaxe PGN é resumida aqui através de alguns exemplos representativos.

source: Please note that, alternatively, the game can be described by passing an URL to a regular .pgn file, as described in the %1$smemo page%2$s.
fr_fr: À noter que, de façon alternative, la partie peut être décrite via une URL pointant vers un fichier .pgn standard, comme il est décrit dans la %1$spage de mémo%2$s.
pt_br: Observe que, alternativamente, a partida pode ser descrita passando um endereço URL para um arquivo .pgn comum, conforme descrito na página %1$stutorial%2$s.

source: Standard PGN game
fr_fr: Partie PGN simple
pt_br: Partida PGN padrão

source: Variations
fr_fr: Variantes
pt_br: Variantes

source: Diagrams
fr_fr: Diagrammes
pt_br: Diagramas

source: Custom starting position
fr_fr: Position de départ particulière
pt_br: Personalizar posição inicial

source: Null moves
fr_fr: Passer son tour
pt_br: Lances nulos

source: Chess960 (aka. Fischer Random Chess)
fr_fr: Chess960 (aussi appelé Fischer Random Chess)
pt_br: Chess960 (também conhecido por 'Fischer Random Chess')

source: Antichess
fr_fr: Qui-perd-gagne

source: Horde chess
fr_fr: Horde

source: The Ruy Lopez: White's third move attacks the knight which defends the e5-pawn from the attack by the f3-knight.
fr_fr: L'espagnole&nbsp;: le troisième coup des blancs attaque le cavalier défendant le pion e5 de l'attaque du cavalier f3.
pt_br: Abertura Ruy Lopez: o terceiro movimento das brancas ataca o cavalo que defende o peão e5 do ataque do cavalo em f3.

source: Typical conjugate square situation.
fr_fr: Manœuvre typique de cases conjuguées.

source: Squares can be highlighted by inserting the tag %1$s[%%csl ...]%2$s in a comment. The squares to highlight are represented by a group of 3 characters: the first one represents the color to use (%1$sG%2$s for green, %1$sR%2$s for red, %1$sY%2$s for yellow), the second and third ones represent the targeted square. For instance, %1$s[%%csl Re5,Gc6,Yf3,Yb5]%2$s highlights square e5 in red, square c6 in green, and squares f3 and b5 in yellow.
fr_fr: Il est possible de faire resortir certaines cases en insérant la balise %1$s[%%csl ...]%2$s dans un commentaire. Les cases à mettre en évidence sont représentées par un groupe de 3 caractères&nbsp;: le premier représente la couleur à utiliser (%1$sG%2$s pour vert, %1$sR%2$s pour rouge, %1$sY%2$s pour jaune), le second et le troisième désignent la case. Par exemple, %1$s[%%csl Re5,Gc6,Yf3,Yb5]%2$s fait resortir e5 en rouge, c6 en vert, et f3 et b5 en jaune.
pt_br: As casas podem ser destacados num comentário inserindo a tag %1$s[%%csl ...]%2$s. Para se destacar uma casa, utiliza-se um grupo de 3 caracteres: o primeiro representa a cor a ser usada (%1$sG%2$s para verde, %1$sR%2$s para vermelho, %1$sY%2$s para amarelo), o segundo e o terceiro representam a coordenada da casa alvo. Por exemplo, %1$s[%%csl Re5,Gc6,Yf3,Yb5]%2$s destaca a casa e5 com vermelho, a casa c6 com verde e as casas f3 e b5 com amarelo.

source: Likewise, arrows can be added by inserting the tag %1$s[%%cal ...]%2$s in a comment. An arrow is encoded by a group of 5 characters: the first one is the color to use (%1$sG%2$s, %1$sR%2$s, or %1$sY%2$s), the second and third ones represent the origin square, the fourth and fifth ones the destination square. For instance, %1$s[%%cal Rf3e5,Gd8d4]%2$s creates a red arrow from f3 to e5, and a green arrow from d8 to d4.
fr_fr: De la même manière, des flèches peuvent être ajoutées en insérant la balise %1$s[%%cal ...]%2$s dans un commentaire. Une flèche est codée par un groupe de 5 caractères&nbsp;: le premier est la couleur à utiliser (%1$sG%2$s, %1$sR%2$s, ou %1$sY%2$s), le second et le troisième représentent la case de départ de la flèche, le quatrième et le cinquième la case d'arrivée. Par exemple, %1$s[%%cal Rf3e5,Gd8d4]%2$s crée une flèche rouge de f3 vers e5, et une flèche verte de d8 à d4.
pt_br: Da mesma forma, setas podem ser adicionadas num comentário inserindo a tag %1$s[%%cal ...]%2$s. Uma seta é codificada por um grupo de 5 caracteres: o primeiro é a cor a ser usada (%1$sG%2$s, %1$sR%2$s, or %1$sY%2$s), o segundo e o terceiro representam as coordenadas da casa de origem, enquanto o quarto e o quinto representam as coordenadas da casa de destino. Por exemplo, %1$s[%%cal Rf3e5,Gd8d4]%2$s cria uma seta vermelha de f3 a e5 e uma seta verde de d8 a d4.

source: Finally, a letter, a digit or a symbol can be used to decorate a square: this is achieved by using the tag %1$s[%%ctl ...]%2$s in a comment. Each decoration is encoded as follows: first comes a character representing the color to use (%1$sG%2$s, %1$sR%2$s, or %1$sY%2$s), then is the symbol to draw on the square (must be an upper-case letter %1$sA-Z%2$s, a lower-case letter %1$sa-z%2$s, a digit %1$s0-9%2$s, or a symbol among %3$s, %4$s, %5$s and %6$s), and finally comes the targeted square. For instance, %1$s[%%ctl GAd4,Yzd5,R(circle)e4]%2$s decorates d4 with a green A, d5 with a yellow z, and e4 with a red circle.
fr_fr: Enfin, une lettre, un chiffre ou un symbole peut être apposé sur une case&nbsp;: ceci se fait en utilisant la balise %1$s[%%ctl ...]%2$s dans un commentaire. Une annotation de ce type est codée comme suit&nbsp;: d'abord un caractère représentant la couleur à utiliser (%1$sG%2$s, %1$sR%2$s, ou %1$sY%2$s), puis le symbole à dessiner (soit une majuscule %1$sA-Z%2$s, une minuscule %1$sa-z%2$s, un chiffre %1$s0-9%2$s, ou un symbole parmi %3$s, %4$s, %5$s et %6$s), et finalement la case ciblée. Par exemple, %1$s[%%ctl GAd4,Yzd5,R(circle)e4]%2$s appose un label A vert sur d4, un label z jaune sur d5, et un cercle rouge sur e4.

source: Square and arrow markers that are created in %3$sChessbase softwares%4$s are exported in PGN format using these %1$s[%%csl ...]%2$s and %1$s[%%cal ...]%2$s notations. On the other hand, the %1$s[%%ctl ...]%2$s notation for text markers is specific to RPB Chessboard.
fr_fr: Les marqueurs de case et les flèches créés dans les %3$slogiciels Chessbase%4$s sont exportés au format PGN en utilisant ces mêmes notations %1$s[%%csl ...]%2$s et %1$s[%%cal ...]%2$s. En revanche, la notation %1$s[%%ctl ...]%2$s est propre à RPB Chessboard.

source: This opening is called the Sicilian defence. A possible continuation is:
fr_fr: Cette ouverture s'appelle la défense sicilienne. Une suite possible est&nbsp;:
pt_br: Esta é a chamada Defesa Siciliana. Uma possível continuação é:

source: Notice that the %1$s tag must not be used outside a PGN game. To insert a diagram outside a PGN game, use the %2$s tag instead.
fr_fr: À noter que la balise %1$s ne peut pas être utilisée en dehors d'une partie PGN. Pour insérer un diagramme hors d'une partie PGN, utiliser plutôt la balise %2$s.
pt_br: Observe que a tag %1$s não deve ser usada fora de uma partida PGN. Para inserir um diagrama fora de um PGN, use a tag %2$s.
