Repository: paolofantozzi/rpb-chessboard
Catalog: languages/rpb-chessboard-*.po
Languages: fr_fr, pt_br

source: Settings of the %1$s plugin
fr_fr: Options du plugin %1$s
pt_br: Opções do plugin %1$s

source: Settings
fr_fr: Options
pt_br: Opções

source: Manage colorsets & piecesets
fr_fr: Gérer les thèmes de couleurs et de pièces
pt_br: Gerenciar temas de cores e peças

source: Theming
fr_fr: Thèmes
pt_br: Temas

source: Help
fr_fr: Aide
pt_br: Ajuda

source: About %1$s
fr_fr: À propos de %1$s
pt_br: Sobre %1$s

source: About
fr_fr: À propos
pt_br: Sobre

source: This plugin allows you to typeset and display chess diagrams and PGN-encoded chess games.
fr_fr: Ce plugin vous permet d'éditer et d'afficher des diagrammes d'échecs ainsi que des parties d'échecs encodées au format PGN.
pt_br: Este plugin permite incorporar e exibir partidas e diagramas de xadrez a partir do formato PGN ou código FEN.

source: Description
pt_br: Descrição

source: Figurines
pt_br: Ícones de peças
