Repository: paolofantozzi/rpb-chessboard
Catalog: languages/rpb-chessboard-*.po
Languages: fr_fr, pt_br

source: As for comments, variations can be rendered either inlined within the move sequence, or as separated paragraphs if they are preceded by a blank line in the PGN string. Variations can be nested. However, inlined variations cannot contain "paragraph-style" variations (or "paragraph-style" comments).
fr_fr: Comme pour les commentaires, les variantes peuvent être affichées soit "en ligne" au sein de la liste de coups, soit sous la forme d'un bloc isolé lorsqu'elles sont précédées d'une ligne vierge dans le texte PGN. Les variantes peuvent être imbriquées les unes dans les autres. Cependant une variante "en ligne" ne peut pas contenir une "variante-bloc" (ou un "commentaire-bloc").
pt_br: Quanto aos comentários, as variantes podem ser inseridas dentro da linha onde está a sequência principal de lances ou em parágrafos separados, quando precedidos por uma linha em branco na sequência PGN. Variantes e subvariantes podem ser aninhadas. No entanto, as subvariantes não poderão ter o "estilo de parágrafo" (nem comentários no "estilo de parágrafo").

source: The %1$s header indicates that the game is a horde chess game.
fr_fr: L'en-tête %1$s indique que la partie est une partie de horde.

source: A standard development scheme for white:
fr_fr: Un schéma de développement classique pour les blancs&nbsp;:
pt_br: Um esquema padrão de desenvolvimento para as peças brancas:

source: A %1$s--%2$s token in the move list allows to skip the underlying move.
fr_fr: Un symbole %1$s--%2$s dans la liste des coups permet de sauter le coup sous-jacent.
pt_br: O código %1$s--%2$s na lista de lances permite pular o lance seguinte.

source: The %1$s header indicates that the game is a Chess960 game (%2$s is also supported), and the %3$s header defines the starting position. Please note that the %3$s header is mandatory for Chess960 games.
fr_fr: L'en-tête %1$s indique que la partie est une partie de Chess960 (la syntaxe %2$s est également acceptée), et l'en-tête %3$s définit la position de départ. Veuillez noter que l'en-tête %3$s est obligatoire dans le cas des parties de Chess960.
pt_br: O cabeçalho %1$s indica que é uma partida de Chess960 (%2$s também é suportado), e o cabeçalho %3$s define a posição inicial. Observe que o cabeçalho %3$s é obrigatório para partidas Chess960.

source: The %1$s header indicates that the game is an Antichess game.
fr_fr: L'en-tête %1$s indique que la partie est une partie de Qui-perd-gagne.

source: Endgame example
fr_fr: Exemple de finale
pt_br: Exemplo de final de partida

source: The %1$s[FEN "..."]%2$s header might be used to specify that the game starts with a custom position. Additionally, the strict PGN syntax requires that %1$s[SetUp "1"]%2$s is added when using the %1$s[FEN "..."]%2$s header.
fr_fr: L'en-tête %1$s[FEN "..."]%2$s peut être utilisé pour définir une position de départ personnalisée. En outre, la syntaxe PGN stricte exige que %1$s[SetUp "1"]%2$s soit ajouté lorsque l'en-tête %1$s[FEN "..."]%2$s est utilisé.
pt_br: O cabeçalho %1$s[FEN "..."]%2$s deve ser usado para especificar que a partida começa a partir de uma posição personalizada. Além disso, a rígida sintaxe PGN exige que %1$s[SetUp "1"]%2$s seja adicionado ao usar o cabeçalho %1$s[FEN "..."]%2$s.

source: Reset settings
fr_fr: Ré-initialiser les paramètres
pt_br: Reiniciar opções para valores padrão

source: This will reset all the settings in this page to their default values. Press OK to confirm...
fr_fr: Toutes les paramètres définis dans cette page vont être ré-initialisés à leurs valeurs par défaut. Cliquer sur OK pour confirmer...
pt_br: Isto vai reiniciar todas as configurações nesta página para seus valores padrão. Pressione OK para confirmar...

source: Compatibility with other chess plugins
fr_fr: Compatibilité avec les autres plugins d'échecs
pt_br: Compatibilidade com outros plugins de xadrez

source: By default, the RPB Chessboard plugin use the %1$s[fen][/fen]%2$s and %1$s[pgn][/pgn]%2$s tags for FEN diagrams and PGN games. However, this behavior causes conflicts with other WordPress plugins (typically chess plugins) that use the same tags. These compatibility settings are provided to avoid those conflicts.
fr_fr: Par défaut, le plugin RPB Chessboard utilise les balises %1$s[fen][/fen]%2$s et %1$s[pgn][/pgn]%2$s pour les diagrammes FEN et les parties PGN. Cependant, ce comportement entraîne des conflits avec les autres plugins WordPress utilisant ces mêmes balises (typiquement d'autres plugins d'échecs). Les paramètres de compatibilité ci-dessous permettent d'éviter ces conflits.
pt_br: Por padrão, o plug-in RPB Chessboard usa as tags %1$s[fen][/fen]%2$s e %1$s[pgn][/pgn]%2$s para diagramas FEN e partidas PGN. No entanto, esse comportamento causa conflitos com outros plugins do WordPress (normalmente plugins de xadrez) que usam as mesmas tags. Essas configurações de compatibilidade são fornecidas para evitar esses conflitos.

source: Compatibility mode for the FEN diagram tag
fr_fr: Mode de compatibilité pour la balise de diagramme FEN

source: Activating this option makes RPB Chessboard use %1$s[fen_compat][/fen_compat]%2$s instead of %1$s[fen][/fen]%2$s for FEN diagrams.
fr_fr: Activer cette option force RPB Chessboard à utiliser %1$s[fen_compat][/fen_compat]%2$s au lieu de %1$s[fen][/fen]%2$s pour les diagrammes FEN.
pt_br: Ativar esta opção faz com que o plugin RPB Chessboard use %1$s[fen_compat][/fen_compat]%2$s em vez de %1$s[fen][/fen]%2$s para diagramas FEN.

source: Compatibility mode for the PGN game tag
fr_fr: Mode de compatibilité pour la balise de partie PGN
pt_br: Modo de compatibilidade para a tag de partida PGN

source: Activating this option makes RPB Chessboard use %1$s[pgn_compat][/pgn_compat]%2$s instead of %1$s[pgn][/pgn]%2$s for PGN games.
fr_fr: Activer cette option force RPB Chessboard à utiliser %1$s[pgn_compat][/pgn_compat]%2$s au lieu de %1$s[pgn][/pgn]%2$s pour les parties PGN.
pt_br: Ativar esta opção faz com que o plugin RPB Chessboard use %1$s[pgn_compat][/pgn_compat]%2$s em vez de %1$s[pgn][/pgn]%2$s para partidas PGN.

source: Compatibility with plugins and themes that modify jQuery
fr_fr: Compatibilité avec les plugins et thèmes qui modifient jQuery
pt_br: Compatibilidade com plugins e temas que modificam jQuery

source: The RPB Chessboard plugin relies heavily on the %1$sjQuery%2$s JavaScript library, which is packaged by default with WordPress. Yet, some plugins and themes modify the standard behavior of jQuery for their own needs, thus creating a conflict with RPB Chessboard. These settings aim at providing a workaround to deal with these conflicts.
fr_fr: Le plugin RPB Chessboard utilise de façon importante la bibliothèque JavaScript %1$sjQuery%2$s, qui est fournie par défaut avec WordPress. Or, il s'avère que certains plugins et thèmes modifient le comportement standard de jQuery pour leurs propres besoins, créant ainsi un conflit avec RPB Chessboard. Le but des paramètres ci-dessous est d'activer des stratégies de contournement pour gérer ces conflits.
pt_br: O plugin RPB Chessboard depende muito da biblioteca JavaScript %1$sjQuery%2$s, que é fornecida por padrão no WordPress. Porém, alguns plugins e temas modificam o comportamento padrão da biblioteca jQuery de acordo com suas próprias necessidades, criando um conflito com o RPB Chessboard. Essas configurações visam fornecer uma solução alternativa para lidar com esses conflitos.

source: Try to fix jQuery's buttons
fr_fr: Réparation des boutons jQuery
pt_br: Reparar botões jQuery

source: Enable this option if the navigation bar does not appear below the navigation board, or if the closing button of the popup frame appears to be weirdly placed.
fr_fr: Activez cette option si la barre de navigation n'apparait pas en dessous de l'échiquier de navigation, ou bien si le bouton de fermeture du popup semble être bizarrement placé.
pt_br: Ative esta opção se a barra de navegação não aparecer abaixo do tabuleiro de navegação ou se o botão para fechar o quadro popup aparecer mal colocado.

source: Compatibility with themes and plugins with complex behaviors
fr_fr: Compatibilité avec les thèmes et plugins ayant des comportements complexes
pt_br: Compatibilidade com temas e plugins que apresentam comportamentos complexos

source: By default, the RPB Chessboard plugin tries to avoid loading its CSS and JavaScript files on pages with no chess diagram or game content, in order to reduce its impact on performance of your website as much as possible. Still, this approach may fail in non-standard situations: for example, if the the theme makes use of AJAX queries to render posts/pages, if you try to use chess diagrams or chess games in post/page comments, in bbPress forums, etc... Disable this option to avoid issues if you are in those situations.
fr_fr: Par défaut, le plugin RPB Chessboard plugin essaie d'éviter de charger ses fichiers CSS/JavaScript sur les pages qui ne contiennent ni diagramme FEN ni partie PGN, ceci afin de ne pas impacter inutilement les performances de votre site web. Néanmoins, cette approche peut ne pas fonctionner dans certaines situations non-standards&nbsp;: par exemple, si le thème utilise des requètes AJAX pour charger les articles ou les pages, si vous insérez des diagrammes ou des parties dans les commentaires des articles ou des pages, dans des forums bbPress, etc... Désactivez cette option afin d'éviter les problèmes si vous vous trouvez dans l'une de ces situations.
pt_br: Por padrão, o plugin RPB Chessboard tenta evitar o carregamento de seus arquivos CSS e JavaScript em páginas sem diagramas ou partidas, a fim de reduzir ao máximo o impacto no desempenho do site. Ainda assim, essa abordagem pode falhar em situações fora do padrão: por exemplo, se o seu tema faz uso de consultas AJAX para renderizar postagens/páginas, se você tentar usar diagramas ou partidas de xadrez em comentários das postagens/páginas, em fóruns do bbPress, etc... Desative esta opção para evitar problemas se você estiver nessas situações.

source: Lazy-loading for CSS/JavaScript files
fr_fr: Chargement paresseux pour les fichiers CSS/JavaScript
pt_br: Carregamento lento para arquivos CSS/JavaScript

source: Disable this option FEN diagrams or PGN games are not properly-rendered on your website.
fr_fr: Désactivez cette option si les diagrammes FEN ou les parties PGN n'apparaissent pas correctement sur votre site web.
pt_br: Desative esta opção se diagramas FEN ou partidas PGN não aparecem corretamente em seu website.

source: Enable support for small-screen devices
fr_fr: Activer la prise en charge des écrans de petite taille
pt_br: Habilitar suporte para dispositivos de tela pequena.

source: Activating this option allows to customize how RPB Chessboard renders chess diagrams on small-screen devices (such as smartphones).
fr_fr: Activer cette option permet de modifier la façon dont RPB Chessboard affiche les diagrammes d'échecs sur les écrans de petite taille (en particulier ceux des smartphones).
pt_br: Ativar esta opção permite personalizar como o plugin RPB Chessboard desenha diagramas de xadrez em dispositivos com tela pequena (como smartphones).

source: These options apply to devices whose resolution is less than %1$s pixel width.
fr_fr: Ces paramètres s'appliquent aux appareils dont la résolution d'écran est inférieur à %1$s pixels en largeur.
pt_br: Estas opções se aplicam a dispositivos cuja resolução seja menor que %1$s pixels de largura.

source: These options apply to devices whose resolution lies between %1$s and %2$s pixel width.
fr_fr: Ces paramètres s'appliquent aux appareils dont la résolution d'écran est comprise entre %1$s and %2$s pixels en largeur.
pt_br: Estas opções se aplicam a dispositivos cuja resolução varie entre %1$s e %2$s pixels de largura.

source: Screen width &le; %1$s pixels
fr_fr: Largeur d'écran &le; %1$s pixels
pt_br: Largura da tela &le; %1$s pixels

source: Restrict square size to: %1$s pixels
fr_fr: Restreindre la taille des cases à&nbsp;: %1$s pixels
pt_br: Limitar o tamanho da casa a: %1$s pixels

source: Chess diagrams will be displayed with a square size not larger than this value if the screen width is less than %1$s pixels, whatever the %2$sdefault aspect and behavior settings%3$s or the tag attributes that may be specified in the posts/pages. Diagrams for which the square size is less than this value will be displayed as they normally do on large screen devices.
fr_fr: Les diagrammes d'échecs seront affichés avec une taille de case jamais plus grande que cette valeur si la résolution d'écran est inférieure à %1$s pixels en largeur, quels que soient les %2$sparamètres d'affichage généraux%3$s ou les attributs de balises susceptibles d'être définis dans les articles/pages. Les diagrammes pour lesquels la taille de case est inférieure à cette valeur seront affichés tels qu'ils le sont normallement sur les grands écrans.
pt_br: Os diagramas de xadrez serão exibidos com casas de tamanho nunca superior a esse valor se a resolução da tela tiver menos de %1$s pixels de largura, independentemente dos %2$sparâmetros gerais de exibição%3$s ou de atributos de tag que possam vir a ser alterados em postagens/páginas. Diagramas com tamanho de casa menor que esse valor serão exibidos normalmente, da mesma maneira que em telas grandes.

source: Always hide coordinates
fr_fr: Toujours masquer les coordonnées
pt_br: Sempre ocultar coordenadas.

source: If enabled, row and column coordinates will be hidden if the screen width is less than %1$s pixels, whatever the %2$sdefault aspect and behavior settings%3$s or the tag attributes that may be specified in the posts/pages. If disabled, row and column coordinates will be displayed as they normally do on large screen devices.
fr_fr: Si cette option est activée, les coordonnées de lignes et de colonnes seront masquées si la résolution d'écran est inférieure à %1$s pixels en largeur, quels que soient les %2$sparamètres d'affichage généraux%3$s ou les attributs de balises susceptibles d'être définis dans les articles/pages. Si elle est désactivée, les coordonnées de lignes et de colonnes seront affichées telles qu'elles le sont normallement sur les grands écrans.
pt_br: Se habilitado, coordenadas de linhas e colunas serão ocultadas se a resolução da tela tiver menos de %1$s pixels de largura, independentemente dos %2$sparâmetros gerais de exibição%3$s ou de atributos de tag que possam vir a ser alterados em postagens/páginas. Se desabilitado, coordenadas de linhas e colunas serão exibidas normalmente, da mesma maneira que em telas grandes.

source: See explanations about theses settings above.
fr_fr: Voir les explications à propos de ces paramètres ci-dessus.
pt_br: Veja, acima, explicações sobre essas opções.

source: English initials
fr_fr: Initiales anglaises
pt_br: Iniciais em inglês

source: Localized initials
fr_fr: Initiales traduites
pt_br: Iniciais em português

source: Custom
fr_fr: Personalisé
pt_br: Personalizar

source: This setting only affects how chess moves are rendered to post/page readers. Authors must always use English initials when writting PGN content into posts and pages.
fr_fr: Ce paramètre n'affecte que la façon dont les coups sont affichés aux lecteurs du blog. Les auteurs doivent toujours utiliser les initiales anglaises lorsqu'ils écrivent des données PGN dans leurs articles et pages.
pt_br: Esta configuração afeta apenas como os lances são mostrados para os leitores da postagem/página. Os autores devem sempre usar as iniciais em inglês ao escrever o conteúdo PGN em suas postagens/páginas.

source: Centered
fr_fr: Centré
pt_br: Centralizado

source: On the left of the text
fr_fr: À gauche du texte
pt_br: À esquerda do texto

source: On the right of the text
fr_fr: À droite du texte
pt_br: À direita do texto

source: This setting affects how diagrams are inserted and placed within the rest of the text (by default).
fr_fr: Ce paramètre détermine la façon dont les diagrammes sont insérés au sein du reste du texte (par défaut).
pt_br: Esta configuração afeta como os diagramas são inseridos e posicionados em relação ao restante do texto (padrão).

source: These settings control the default aspect and behavior of the chess diagrams and games inserted in posts and pages with the %1$s[%3$s][/%3$s]%2$s and %1$s[%4$s][/%4$s]%2$s tags. They can be overridden at each tag by passing appropriate tag attributes: see %5$shelp on FEN diagram attributes%7$s and %6$shelp on PGN game attributes%7$s for more details.
fr_fr: Ces paramètres déterminent l'apparence et le comportement qu'adoptent par défaut les diagrammes et parties d'échecs insérés dans les articles et pages du blog au moyen des balises %1$s[%3$s][/%3$s]%2$s et %1$s[%4$s][/%4$s]%2$s. Ils peuvent être modifiés au niveau de chacune des balises en spécifiant des attributs de balise ad hoc&nbsp;: voir l'aide sur les %5$sattributs de diagramme FEN%7$s et sur les %6$sattributs de partie PGN%7$s pour plus de détails.
pt_br: Estas configurações controlam a aparência e o comportamento padrão dos diagramas e partidas de xadrez inseridos em postagens e páginas com tags %1$s[%3$s][/%3$s]%2$ e %1$s[%4$s][/%4$s]%2$s. Elas podem ser substituídos em cada tag ao passar atributos apropriados: consulte %5$sajuda em atributos para diagrama FEN%7$s e %6$sajuda em atributos de partida PGN%7$s para obter mais detalhes.

source: Position of the navigation board
fr_fr: Position de l'échiquier de navigation
pt_br: Posição do tabuleiro de navegação

source: No navigation board
fr_fr: Pas d'échiquier de navigation
pt_br: Sem tabuleiro de navegação

source: In a popup frame
fr_fr: Dans un popup
pt_br: Abrir em quadro popup

source: Above the game headers and the move list
fr_fr: Au-dessus des en-têtes et de la liste de coups
pt_br: Acima do cabeçalho e lista de lances

source: Below the move list
fr_fr: À gauche de la liste de coups
pt_br: Abaixo da lista de lances

source: On the left of the move list
fr_fr: À gauche de la liste de coups
pt_br: À esquerda da lista de lances

source: On the right of the move list
fr_fr: À droite de la liste de coups
pt_br: À direita da lista de lances

source: On the left, with scrollable move list
fr_fr: À gauche, avec une barre de défilement pour la liste de coups
pt_br: À esquerda, com barra para rolagem da lista de lances

source: On the right, with scrollable move list
fr_fr: À droite, avec une barre de défilement pour la liste de coups
pt_br: À direita, com barra para rolagem da lista de lances

source: A navigation board may be added to each PGN game to help post/page readers to follow the progress of the game. This navigation board is displayed either in a popup frame (in this case, it becomes visible only when the reader clicks on a move) or next to the move list (then it is visible as soon as the page is loaded).
fr_fr: Un échiquier de navigation peut être adjoint à chaque partie PGN pour aider les lecteurs du blog à suivre la progression de la partie. Cet échiquier de navigation est affiché soit dans un popup (dans ce cas, il ne devient visible que lorsque le lecteur clique sur un coup), soit à côté de la liste des coups (il est alors visible dès que la page est chargée).
pt_br: Um tabuleiro de navegação pode ser adicionado a cada partida PGN para ajudar os leitores da postagem/página a acompanhar o progresso da partida. Esse tabuleiro de navegação será exibido num quadro popup (nesse caso, fica visível apenas quando o leitor clica num lance) ou ao lado da lista de lances (visível assim que a página é carregada).

source: Show flip button
fr_fr: Afficher le bouton pour tourner l'échiquier
pt_br: Mostrar botão para girar tabuleiro

source: Show download button
fr_fr: Afficher le bouton de téléchargement
pt_br: Mostrar botão de download

source: These settings allow to customize the toolbar that is displayed below the navigation board.
fr_fr: Ces paramètres permettent de personnaliser la barre d'outils affichée en dessous de l'échiquier de navigation.
pt_br: Configurações de personalização da barra de ferramentas abaixo do tabuleiro de navegação.

source: Square size: %1$s pixels
fr_fr: Taille des cases&nbsp;: %1$s pixels
pt_br: Tamanho da casa: %1$s pixels

source: Note that specific chessboard aspect settings can be defined for %1$ssmall-screen devices%3$s (such as smartphones). Additional colorsets and piecesets can be created in the %2$stheming page%3$s.
fr_fr: À noter que l'apparance des échiquiers peut être modifiée pour les %1$sécrans de petite taille%3$s (en particulier ceux des smartphones). Des thèmes de couleurs et de pièces supplémentaires peuvent être créés sur la %2$spage des thèmes%3$s.
pt_br: Observe que configurações específicas para a aparência do tabuleiro podem ser definidas para %1$sdispositivos de tela pequena%3$s (como smartphones). Temas adicionais de cores e peças podem ser criados na página %2$stemas%3$s.

source: Show move arrow
fr_fr: Mettre en évidence le déplacement avec une flèche
pt_br: Realçar lance com uma seta

source: Test move
fr_fr: Tester un coup
pt_br: Testar um lance

source: Test capture
fr_fr: Tester une capture
pt_br: Testar uma captura

source: You must activate JavaScript to enhance chess game visualization.
fr_fr: Vous devez activer JavaScript pour améliorer l'affichage des parties d'échecs.
pt_br: Você precisa ativar o JavaScript para melhorar a vizualicação das partidas de xadrez.

source: You must activate JavaScript to enhance chess diagram visualization.
fr_fr: Vous devez activer JavaScript pour améliorer l'affichage des diagrammes d'échecs.
pt_br: Você precisa ativar o JavaScript para melhorar a vizualicação dos diagramas.

source: Chess diagram
fr_fr: Diagrammes d'échecs

source: Move pieces
fr_fr: Déplacer des pièces

source: Add white pieces
fr_fr: Ajouter des pièces blanches

source: Add black pieces
fr_fr: Ajouter des pièces noires

source: Add white pawn
fr_fr: Ajouter un pion blanc

source: Add white knight
fr_fr: Ajouter un cavalier blanc

source: Add white bishop
fr_fr: Ajouter un fou blanc

source: Add white rook
fr_fr: Ajouter une tour blanche

source: Add white queen
fr_fr: Ajouter une dame blanche

source: Add white king
fr_fr: Ajouter un roi blanc

source: Add black pawn
fr_fr: Ajouter un pion noir

source: Add black knight
fr_fr: Ajouter un cavalier noir

source: Add black bishop
fr_fr: Ajouter un fou noir

source: Add black rook
fr_fr: Ajouter une tour noire

source: Add black queen
fr_fr: Ajouter une dame noire

source: Add black king
fr_fr: Ajouter un roi noir

source: Toggle turn
fr_fr: Changer le joueur au trait

source: Flip board
fr_fr: Tourner l'échiquier

source: Clear
fr_fr: Vider l'échiquier

source: Clear annotations
fr_fr: Supprimer les annotations

source: Square marker
fr_fr: Marqueur de case

source: Arrow marker
fr_fr: Flèches

source: Marker %s
fr_fr: Marqueur %s

source: Reset to the startup position
fr_fr: Replacer les pièces à leur position de départ

source: Remove all pieces
fr_fr: Supprimer toutes les pièces

source: Remove all square/arrow/text markers
fr_fr: Supprimer les marqueurs de case, flèches, et labels de case

source: Use default square size
fr_fr: Taille de case par défaut

source: Coordinates
fr_fr: Coordonnées

source: Colorset
fr_fr: Thème de couleurs

source: Pieceset
fr_fr: Thème de pièces

source: Use default
fr_fr: Par défaut

source: Current edition mode
fr_fr: Mode d'édition courant

source: Float on left
fr_fr: Flottant à gauche

source: Float on right
fr_fr: Flottant à droite

source: Hidden
fr_fr: Invisible

source: Error in the FEN string describing the chess diagram
fr_fr: Erreur dans la chaîne de caractères FEN décrivant le diagramme d'échecs

source: Chess games and diagrams
fr_fr: Parties et diagrammes d'échecs
pt_br: Partidas e diagramas de xadrez

source: Chess
fr_fr: Échecs
pt_br: Xadrez

source: Memo
fr_fr: Mémo
pt_br: Tutorial
