Repository: paolofantozzi/rpb-chessboard
Catalog: languages/rpb-chessboard-*.po
Languages: fr_fr, pt_br

source: (no name)
fr_fr: (pas de nom)
pt_br: (sem nome)

source: K
fr_fr: R
pt_br: R

source: Q
fr_fr: D
pt_br: D

source: R
fr_fr: T
pt_br: T

source: B
fr_fr: F

source: N
fr_fr: C
pt_br: C

source: Colorsets
fr_fr: Thèmes de couleurs
pt_br: Temas de cores

source: Piecesets
fr_fr: Thèmes de pièces
pt_br: Temas de peças

source: Delete colorset "%1$s"?. Press OK to confirm...
fr_fr: Supprimer le thème de couleurs "%1$s"&nbsp;? Cliquer sur OK pour confirmer...
pt_br: Deletar tema de cores "%1$s"?. Clique OK para confirmar...

source: Delete pieceset "%1$s"?. Press OK to confirm...
fr_fr: Supprimer le thème de pièces "%1$s"&nbsp;? Cliquer sur OK pour confirmer...
pt_br: Deletar tema de peças "%1$s"?. Clique OK para confirmar...

source: My colorset
fr_fr: Mon thème de couleurs
pt_br: Meu tema de cores

source: My pieceset
fr_fr: Mon thème de pièces
pt_br: Meu tema de peças

source: Select the image to use for black pawns
fr_fr: Sélectionner l'image à utiliser pour les pions noirs
pt_br: Selecionar a imagem a utilizar para peões pretos

source: Select the image to use for black knights
fr_fr: Sélectionner l'image à utiliser pour les cavaliers noirs
pt_br: Selecionar a imagem a utilizar para cavalos pretos

source: Select the image to use for black bishops
fr_fr: Sélectionner l'image à utiliser pour les fous noirs
pt_br: Selecionar a imagem a utilizar para bispos pretos

source: Select the image to use for black rooks
fr_fr: Sélectionner l'image à utiliser pour les tours noires
pt_br: Selecionar a imagem a utilizar para torres pretas

source: Select the image to use for black queens
fr_fr: Sélectionner l'image à utiliser pour les dames noires
pt_br: Selecionar a imagem a utilizar para damas pretas

source: Select the image to use for black kings
fr_fr: Sélectionner l'image à utiliser pour les rois noirs
pt_br: Selecionar a imagem a utilizar para reis pretos

source: Select the image to use for black turn flags
fr_fr: Sélectionner l'image à utiliser pour les indicateurs de trait aux noirs
pt_br: Selecionar a imagem a utilizar para indicar vez de jogar das pretas

source: Select the image to use for white pawns
fr_fr: Sélectionner l'image à utiliser pour les pions blancs
pt_br: Selecionar a imagem a utilizar para peões brancos

source: Select the image to use for white knights
fr_fr: Sélectionner l'image à utiliser pour les cavaliers blancs
pt_br: Selecionar a imagem a utilizar para cavalos brancos

source: Select the image to use for white bishops
fr_fr: Sélectionner l'image à utiliser pour les fous blancs
pt_br: Selecionar a imagem a utilizar para bispos brancos

source: Select the image to use for white rooks
fr_fr: Sélectionner l'image à utiliser pour les tours blanches
pt_br: Selecionar a imagem a utilizar para torres brancas

source: Select the image to use for white queens
fr_fr: Sélectionner l'image à utiliser pour les dames blanches
pt_br: Selecionar a imagem a utilizar para damas brancas

source: Select the image to use for white kings
fr_fr: Sélectionner l'image à utiliser pour les rois blancs
pt_br: Selecionar a imagem a utilizar para reis brancos

source: Select the image to use for white turn flags
fr_fr: Sélectionner l'image à utiliser pour les indicateurs de trait aux blancs
pt_br: Selecionar a imagem a utilizar para indicar vez de jogar das brancas

source: %1$s[%3$s][/%3$s]%2$s tag attributes
fr_fr: Attributs de la balise %1$s[%3$s][/%3$s]%2$s
pt_br: %1$s[%3$s][/%3$s]%2$s atributos de tag

source: PGN game syntax
fr_fr: Format des parties PGN
pt_br: Sintaxe de partida PGN

source: FEN diagram syntax
fr_fr: Format des diagrammes FEN
pt_br: Sintaxe de diagrama FEN

source: Default aspect & behavior settings
fr_fr: Apparence et comportement par défaut
pt_br: Configurações padrão de aparência e comportamento

source: Compatibility settings
fr_fr: Paramètres de compatibilité
pt_br: Configurações de compatibilidade

source: Small-screen devices
fr_fr: Écrans de petite taille
pt_br: Dispositivos de telas reduzidas

source: Pieceset created.
fr_fr: Thème de pièces créé.
pt_br: Tema de peças criado.

source: Pieceset updated.
fr_fr: Thème de pièces modifié.
pt_br: Tema de peças atualizado.

source: Pieceset deleted.
fr_fr: Thème de pièces supprimé.
pt_br: Tema de peças apagado.

source: Settings saved.
fr_fr: Options enregistrées.
pt_br: Configurações salvas.

source: Default colorset changed.
fr_fr: Thème de couleurs par défaut modifié.
pt_br: Tema de cores padrão alterado.

source: Default pieceset changed.
fr_fr: Thème de pièces par défaut modifié.
pt_br: Tema de peças padrão alterado.

source: Colorset created.
fr_fr: Thème de couleurs créé.
pt_br: Tema de cores criado.

source: Colorset updated.
fr_fr: Thème de couleurs modifié.
pt_br: Tema de cores atualizado.

source: Colorset deleted.
fr_fr: Thème de couleurs supprimé.
pt_br: Tema de cores apagado.

source: Settings reseted.
fr_fr: Paramètres ré-initialisés.
pt_br: Configurações padrão restauradas.

source: To work properly, the RPB Chessboard plugin needs JavaScript to be activated in your browser.
fr_fr: Pour fonctionner correctement, le plugin RPB Chessboard a besoin que JavaScript soit activé dans votre navigateur.
pt_br: Para seu bom funcionamento, RPB Chessboard precida que o JavaScript esteja ativado em seu navegador de internet.

source: PGN game
fr_fr: Partie PGN
pt_br: Partida PGN

source: Two different syntaxes exist for PGN games:
fr_fr: Deux syntaxes différentes existent pour les parties au format PGN&nbsp;:
pt_br: Há duas sintaxes diferentes para uma partida PGN:

source: Here, the URL targets a .pgn file that contains the game. This type of file can be generated by any chess database software, including %1$sChessbase%4$s, %2$sScid%4$s, etc... See an example of a .pgn file %3$shere%4$s.
fr_fr: Ici, l'URL pointe vers un fichier .pgn qui contient la partie. Ce type de fichier peut être généré par n'importe quel logiciel de base de données échiquéenne, notamment %1$sChessbase%4$s, %2$sScid%4$s, etc... Voir un exemple de fichier .pgn %3$sici%4$s.
pt_br: Aqui, o endereço URL leva a um arquivo .pgn que contém a partida. Esse tipo de arquivo pode ser gerado por qualquer software de banco de dados de xadrez, incluindo %1$sChessbase%4$s, %2$sScid%4$s, etc... Veja %3$saqui%4$s um exemplo de arquivo .pgn.

source: Please note that a .pgn file may contain several games. The attribute %1$s might be used to select which game in the file should be displayed (for instance, use %2$s to display the first game in the file, %3$s for the second game, etc...).
fr_fr: À noter qu'un fichier .pgn est susceptible de contenir plusieurs parties. L'attribut %1$s doit être utilisé pour sélectionner la partie à afficher (par exemple, spécifier %2$s pour afficher la première partie du fichier, %3$s pour la seconde, etc...).
pt_br: Observe que um arquivo .pgn pode conter várias partidas. O atributo %1$s deve ser usado para selecionar qual partida no arquivo deve ser exibida (por exemplo, use %2$s para exibir a primeira partida do arquivo, %3$s para a segunda, e assim por diante.

source: Morphy took twelve minutes over his next move, probably to assure himself that the combination was sound and that he had a forced win in every variation.
fr_fr: Morphy réfléchit douze minutes sur le coup suivant, sans doute pour s'assurer que la combinaison était correcte et que le gain était forcé dans toutes les variantes.
pt_br: Morphy usou doze minutos para decidir sua próxima jogada, provavelmente para garantir a si mesmo que a combinação era correta e que ele teria uma vitória forçada em todas as variantes.

source: Not
fr_fr: Pas
pt_br: Não

source: would have won more quickly. For instance:
fr_fr: aurait gagné plus rapidement. Par exemple&nbsp;:
pt_br: teria vencido mais rápido. Por exemplo:

source: Absolutely forced.
fr_fr: Complètement forcé.
pt_br: Absolutamente forçado.

source: With this second syntax, the game is described by the code between the %1$s tags. The used notation follows the standard %2$sPGN format%3$s. It can be copy-pasted from a .pgn file generated by any chess database software.
fr_fr: Avec cette seconde syntaxe, la partie est décrite par le code placé entre les balises %1$s. La notation utilisée suit le %2$sformat PGN%3$s usuel. Il peut être copié-collé à partir d'un fichier .pgn généré par n'importe quel logiciel de base de données échiquéenne.
pt_br: Com essa segunda sintaxe, a partida é descrita pelo código entre as tags %1$s. A notação usada segue o formato %2$sPGN%3$s padrão. Ele pode ser copiado e colado de um arquivo .pgn gerado por qualquer software de banco de dados de xadrez.

source: https://en.wikipedia.org/wiki/Portable_Game_Notation
fr_fr: https://fr.wikipedia.org/wiki/Portable_Game_Notation

source: Please note the %1$s tag placed inside a comment to insert a diagram showing the current position.
fr_fr: Remarquez la balise %1$s placée dans un commentaire pour insérer un diagramme montrant la position courante.
pt_br: Observe a tag %1$s deve ser colocada dentro de um comentário para inserir um diagrama mostrando a posição atual.

source: FEN diagram
fr_fr: Diagramme FEN
pt_br: Diagrama FEN

source: White to move and mate in two:
fr_fr: Trait aux blancs, mat en deux&nbsp;:
pt_br: Brancas jogam, mate em dois lances:

source: This position is known as the Légal Trap. It is named after the French player François Antoine de Legall de Kermeur (1702&ndash;1792).
fr_fr: Cette position est appelée mat de Legal. Elle doit son nom au joueur français François Antoine de Kermur Sire de Legale (1702&ndash;1792).
pt_br: Esta posição é conhecida como 'Armadilha de Légal'. Recebe este nome em homenagem ao jogador francês François Antoine de Legall de Kermeur (1702&ndash;1792).

source: The string between the %1$s[%3$s][/%3$s]%2$s tags describe the position. The used notation follows the %4$sFEN format%5$s (Forsyth-Edwards Notation). A comprehensive description of this FEN notation is available on %4$sWikipedia%5$s.
fr_fr: Le texte entre les balises %1$s[%3$s][/%3$s]%2$s décrit la position. La notation utilisée suit le %4$sformat FEN%5$s (Forsyth-Edwards Notation). Une description exhaustive de cette notation FEN est disponible sur %4$sWikipédia%5$s.
pt_br: A sequência de caracteres entre as tags %1$s[%3$s][/%3$s]%2$s descreve a posição. A notação usada segue o %4$scódigo FEN%5$s (Forsyth-Edwards Notation). Uma descrição abrangente da notação FEN está disponível na %4$sWikipedia%5$s.

source: https://en.wikipedia.org/wiki/Forsyth-Edwards_Notation
fr_fr: https://fr.wikipedia.org/wiki/Notation_Forsyth-Edwards

source: This short reminder presents through examples the features provided by the RPB Chessboard plugin, namely the insertion of chess diagrams and games in WordPress websites. On the left is the code written in posts and pages, while the right column shows the corresponding rendering.
fr_fr: Ce court pense-bête présente au travers d'exemples les fonctionnalités offertes par le plugin RPB Chessboard, à savoir l'insertion de diagrammes et parties d'échecs dans les sites webs WordPress. La colonne de gauche montre le code écrit dans les articles et les pages, la colonne de droite le rendu correspondant.
pt_br: Este breve tutorial apresenta, através de exemplos, os recursos fornecidos pelo plugin RPB Chessboard, a saber, a inserção de diagramas e partidas de xadrez em sites do WordPress. A coluna esquerda exemplifica o código escrito nas postagens/páginas, enquanto a coluna direita mostra o resultado correspondente.

source: RPB Chessboard allows you to typeset and display chess games and diagrams in the posts and pages of your WordPress blog, using the standard %1$sFEN%3$s and %2$sPGN%3$s notations.
fr_fr: RPB Chessboard vous permet d'éditer et d'afficher des parties et des diagrammes d'échecs dans les articles et pages de votre blog WordPress, en utilisant les notations usuelles %1$sFEN%3$s et %2$sPGN%3$s.
pt_br: O plugin RPB Chessboard permite que você comente e exiba partidas e diagramas de xadrez em postagens/páginas do seu blog WordPress, usando as notações padrão %1$sFEN%3$s e %2$sPGN%3$s.

source: source code on GitHub
fr_fr: code source sur GitHub
pt_br: código fonte no GitHub

source: If you need help to use this plugin, if you encounter some bugs, or if you wish to get new features in the future versions, please feel free to use the GitHub tracker.
fr_fr: Si vous avez besoin d'aide pour utiliser ce plugin, si vous rencontrez des bugs, ou bien si vous souhaitez voir implémenté de nouvelles fonctionnalités dans les versions futures, veuillez utiliser le %1$stracker GitHub%2$s.
pt_br: Se precisar de ajuda para usar este plugin, se encontrar alguns bugs ou se desejar obter novos recursos em versões futuras, sinta-se à vontade para usar o %1$sGitHub tracker%2$s.

source: Need help
fr_fr: Besoin d'aide
pt_br: Preciso de ajuda

source: Report a bug
fr_fr: Signaler un bug
pt_br: Relatar um bug

source: This plugin is and will remain free. However, if you want to make a donation to support the author's work, you can do it through this PayPal link.
fr_fr: Ce plugin est et restera gratuit. Cependant, si vous souhaitez faire un don pour soutenir le travail de l'auteur, vous pouvez le faire via ce lien PayPal.
pt_br: Este plugin é e permanecerá gratuito. No entanto, se você quiser fazer uma doação para apoiar o trabalho do autor, poderá fazê-lo através deste link do PayPal.

source: Donate
fr_fr: Faire un don
pt_br: Doar

source: Plugin version
fr_fr: Version du plugin
pt_br: Versão do plugin

source: Credits
fr_fr: Crédits
pt_br: Créditos

source: Author
fr_fr: Auteur
pt_br: Autor

source: Contributors
fr_fr: Contributeurs
pt_br: Colaboradores

source: Translators
fr_fr: Traducteurs
pt_br: Tradutores

source: If you are interested in translating this plugin into your language, please %1$scontact the author%2$s.
fr_fr: Si vous souhaitez traduire ce plugin dans votre langue, merci de %1$scontacter l'auteur%2$s.
pt_br: Se você estiver interessado em traduzir este plugin para o seu idioma, favor %1$sentrar em contato com o autor%2$s.

source: Graphic resources
fr_fr: Graphismes
pt_br: Recursos gráficos

source: Pieceset %1$sCBurnett%2$s has been created by %3$sColin M.L. Burnett%6$s, who shares it under the [CC-BY-SA] license on %4$sWikimedia Commons%6$s; user %5$sAntonsusi%6$s has also contributed to this work.
fr_fr: Le thème de pièces %1$sCBurnett%2$s a été créé par %3$sColin M.L. Burnett%6$s, qui le partage sous licence [CC-BY-SA] sur %4$sWikimedia Commons%6$s&nbsp;; l'utilisateur %5$sAntonsusi%6$s a également travaillé sur ce thème.
pt_br: O tema de peças %1$sCBurnett%2$s foi criado por %3$sColin M.L. Burnett%6$s, que o compartilha sob a licença [CC-BY-SA] de %4$sWikimedia Commons%6$s; o usuário %5$sAntonsusi%6$s também contribuiu para este trabalho.

source: Piecesets %1$sCeltic%2$s, %1$sEyes%2$s, %1$sFantasy%2$s, %1$sSkulls%2$s and %1$sSpatial%2$s have been created by %3$sMaurizio Monge%4$s, who makes them freely available for chess programs.
fr_fr: Les thèmes %1$sCeltic%2$s, %1$sEyes%2$s, %1$sFantasy%2$s, %1$sSkulls%2$s et %1$sSpatial%2$s ont été créés par %3$sMaurizio Monge%4$s, qui les met à disposition gratuitement pour les programmes d'échecs.
pt_br: Os temas de peças %1$sCeltic%2$s, %1$sEyes%2$s, %1$sFantasy%2$s, %1$sSkulls%2$s e %1$sSpatial%2$s foram criados por %3$sMaurizio Monge%4$s, que os disponibiliza gratuitamente para programas de xadrez.

source: Colorsets %1$sCoral%2$s, %1$sDusk%2$s, %1$sEmerald%2$s, %1$sMarine%2$s, %1$sSandcastle%2$s and %1$sWheat%2$s have been proposed in this %3$sblog post%5$s by %4$sGorgonian%5$s.
fr_fr: Les thèmes de couleurs %1$sCoral%2$s, %1$sDusk%2$s, %1$sEmerald%2$s, %1$sMarine%2$s, %1$sSandcastle%2$s et %1$sWheat%2$s ont été proposés dans cet %3$sarticle de blog%5$s par %4$sGorgonian%5$s.
pt_br: Os temas de cores %1$sCoral%2$s, %1$sDusk%2$s, %1$sEmerald%2$s, %1$sMarine%2$s, %1$sSandcastle%2$s e %1$sWheat%2$s foram propostos neste %3$sblog%5$s por %4$sGorgonian%5$s.

source: Icon %1$sTick%2$s has been created by %3$sMomentum Design Lab%5$s, who shares it under the [CC-BY] license on %4$sFind Icons%5$s.
fr_fr: L'icône %1$sTick%2$s a été créée par %3$sMomentum Design Lab%5$s, qui la partage sous licence [CC-BY] sur %4$sFind Icons%5$s.

source: Icon %1$sNot-Found%2$s has been created by %3$sgakuseiSean%5$s, who makes it freely available for non-commercial use on %4$sFind Icons%5$s.
fr_fr: L'icône %1$sNot-Found%2$s a été crée par %3$sgakuseiSean%5$s, qui la met à disposition gratuitement pour des usages non-commerciaux sur %4$sFind Icons%5$s.
pt_br: Ícone %1$sNot-Found%2$s foi criado por %3$sgakuseiSean%5$s, que o disponibiliza gratuitamente para uso não comercial em %4$sFind Icons%5$s.

source: Icon %1$sHelp%2$s has been created by %3$sRuby Software%5$s, who shares it as a freeware on %4$sFind Icons%5$s.
fr_fr: L'icône %1$sHelp%2$s a été crée par %3$sRuby Software%5$s, qui la partage en tant que freeware sur %4$sFind Icons%5$s.
pt_br: Ícone %1$sHelp%2$s foi criado por %3$sRuby Software%5$s, que o disponibiliza como freeware em %4$sFind Icons%5$s.

source: The author would like to thank all these people for their highly valuable work.
fr_fr: L'auteur remercie toutes ces personnes pour la grande qualité de leur travail.
pt_br: O autor gostaria de agradecer a todas essas pessoas por seu trabalho de grande qualidade e valor.

source: License
fr_fr: Licence
pt_br: Licença

source: This plugin is distributed under the terms of the %1$sGNU General Public License version 3%3$s (GPLv3), as published by the %2$sFree Software Foundation%3$s. The full text of this license is available at %4$s. A copy of this document is also provided with the plugin source code.
fr_fr: Ce plugin est distribué sous les termes de la %1$sGNU General Public License version 3%3$s (GPLv3), telle que publiée par la %2$sFree Software Foundation%3$s. Le texte complet de cette licence est disponible à l'adresse %4$s. Une copie de ce document est également fournie avec le code source du plugin.
pt_br: Este plugin é distribuído sob os termos da %1$sGNU General Public License version 3%3$s (GPLv3), conforme publicado pela %2$sFree Software Foundation%3$s. O texto completo desta licença está disponível em %4$s. Uma cópia deste documento também é fornecida junto com com o código fonte deste plugin.

source: This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.
fr_fr: Ce programme est distribué dans l'espoir qu'il vous sera utile, mais SANS AUCUNE GARANTIE&nbsp;: sans même la garantie implicite de COMMERCIALISABILITÉ ni d'ADÉQUATION À UN OBJECTIF PARTICULIER. Consultez la GNU General Public License pour plus de détails.
pt_br: O programa é distribuído na esperança de que seja útil, mas SEM QUALQUER GARANTIA; sem sequer a garantia implícita de COMERCIALIZAÇÃO ou ADEQUAÇÃO A UM OBJETIVO ESPECÍFICO. Veja a Licença Pública Geral GNU para mais detalhes.

source: Show annotations
fr_fr: Afficher les annotations

source: Add a new pieceset
fr_fr: Ajouter un thème
pt_br: Adicionar um novo tema de peças

source: Name
fr_fr: Nom
pt_br: Nome

source: Default
fr_fr: Par&nbsp;défaut
pt_br: Padrão

source: Set default
fr_fr: Définir par défaut
pt_br: Definir padrão

source: Edit
fr_fr: Modifier
pt_br: Editar

source: Delete
fr_fr: Supprimer
pt_br: Deletar

source: Select
fr_fr: Sélectionner
pt_br: Selecionar

source: All the images must be defined to create a pieceset.
fr_fr: Toutes les images doivent être définies pour créer un thème de pièces.
pt_br: Todas as imagens devem ser definidas para criar um tema de peças.

source: New pieceset
fr_fr: Nouveau thème
pt_br: Novo tema de peças

source: Edit pieceset
fr_fr: Modifier le thème
pt_br: Editar tema de peças

source: Create pieceset
fr_fr: Créer le thème
pt_br: Criar tema de peças

source: Save changes
fr_fr: Enregistrer les modifications
pt_br: Salvar alterações

source: Cancel
fr_fr: Annuler
pt_br: Cancelar

source: New colorset
fr_fr: Nouveau thème
pt_br: Novo tema de cores

source: Edit colorset
fr_fr: Modifier le thème
pt_br: Editar tema de cores

source: Dark squares
fr_fr: Cases noires
pt_br: Casas pretas

source: Light squares
fr_fr: Cases blanches
pt_br: Casas brancas

source: Move arrow
fr_fr: Flèche de déplacement

source: Green markers
fr_fr: Marqueurs verts

source: Red markers
fr_fr: Marqueurs rouges

source: Yellow markers
fr_fr: Marqueurs jaunes

source: Create colorset
fr_fr: Créer le thème
pt_br: Criar tema de cores

source: Add a new colorset
fr_fr: Ajouter un thème
pt_br: Adicionar um novo tema de cores

source: Piece symbols
fr_fr: Symboles des pièces
pt_br: Símbolos de peças

source: The %1$s attribute controls how chess pieces are denoted in the move list.
fr_fr: L'attribut %1$s modifie la façon dont les pièces sont représentées dans la liste des coups.
pt_br: O atributo %1$s controla como as peças de xadrez são mostradas no texto da lista de lances.

source: Value
fr_fr: Valeur
pt_br: Valor

source: First character of the piece name in English.
fr_fr: Initiale du nom de la pièce en anglais.
pt_br: Primeira letra do nome da peça em inglês.

source: First character of the piece name in the blog language.
fr_fr: Initiale du nom de la pièce dans la langue du blog.
pt_br: Primeira letra do nome da peça na língua do seu blog.

source: Any sequence of 6 capital letters surrounded with parenthesis is allowed to set custom symbols. For instance, with %1$s(%3$s%4$s%5$s%6$s%7$s%8$s)%2$s, %3$s will be used to denote a king, %4$s for a queen, %5$s for a rook, %6$s for a bishop, %7$s for a knight and %8$s for a pawn.
fr_fr: N'importe quelle séquence de 6 lettres majuscules encadrées de parenthèses peut être utilisée pour spécifier des symboles personnalisés. Par exemple, avec %1$s(%3$s%4$s%5$s%6$s%7$s%8$s)%2$s, le roi sera représenté par %3$s, la dame par %4$s, la tour par %5$s, le fou par %6$s, le cavalier par %7$s, et le pion par %8$s.
pt_br: Qualquer sequência de 6 letras maiúsculas entre parênteses é permitida para definir símbolos personalizados. Por exemplo, %1$s(%3$s%4$s%5$s%6$s%7$s%8$s)%2$s, %3$s será usado para indicar um rei, %4$s para uma dama, %5$s para uma torre, %6$s para um bispo, %7$s para um cavalo e %8$s para um peão.

source: Several attributes may be passed to the %1$s[%3$s][/%3$s]%2$s tags in order to customize how the PGN games are displayed. All these attributes are optional: if not specified, the default setting (defined by the blog administrator) applies. These attributes are presented in this page.
fr_fr: Plusieurs attributs peuvent être passés aux balises %1$s[%3$s][/%3$s]%2$s afin de personaliser la façon dont les parties PGN sont affichées. Tous ces attributs sont optionnels&nbsp;: s'ils ne sont pas spécifiés, une valeur par défaut (définie par l'administrateur du blog) est utilisée. Ces attributs sont présentés ci-dessous.
pt_br: Vários atributos podem ser passados para as tags %1$s[%3$s][/%3$s]%2$s de modo a personalizar a exibição de partidas PGN. Todos esses atributos são opcionais: se não especificados, a configuração padrão (definida pelo administrador do blog) se aplica. Esses atributos são apresentados nesta página.

source: Navigation board
fr_fr: Échiquier de navigation
pt_br: Tabuleiro de navegação

source: Navigation toolbar
fr_fr: Barre d'outils de navigation
pt_br: Menu de navegação

source: Move animation
fr_fr: Animation des coups
pt_br: Animação de lance.

source: Chessboard aspect
fr_fr: Apparance des échiquiers
pt_br: Aparência do tabuleiro

source: The %1$s attribute controls the position of the navigation board.
fr_fr: L'attribut %1$s détermine la position de l'échiquier de navigation.
pt_br: O atributo %1$s controla a posição do tabuleiro de navegação.
